content/id/pemrograman-literasi/index.org
#+TITLE: Pemrograman Literasi
#+AUTHOR: Fikri Rahmat Nurhidayat
#+EMAIL: fikrirnurhidayat@gmail.com
#+DATE: <2022-07-02 Sat>

Pemrograman terpelajar? Pemrograman sastra? Pemrograman non-primitif?

* Kamu mau ngapain sih, Fik?

Gatau, gabut, yaudah aku bikin video aja.

Pernah ga sih kalian ngoding sesuatu, terus kalian ninggalin kodingan itu selama 1 abad terus tau-tau balik lagi ke kode itu dan kalian bingung buat memahaminya?

Ahah, masalah klasik dari seorang /programmer/, yaitu tidak pernah mendokumentasikan kode dengan baik.

Di presentasi ini kita bakal bahas apa sih pemrograman literasi itu, dan kenapa kok ini keren banget buat kita sebagai programmer untuk mulai mencobanya.

* Pemrograman Literasi, apaan tuh?

Mungkin kamu sebagai programmer udah bosen lah denger istilah =Something Programming=, sebagai contoh:

- /Object Oriented Programming/ (Pemrograman Berbasis Objek)
- /Functional Programming/ (Pemrograman Fungsional)
- /Declarative Programming/ (Pemrograman Deklaratif)
- /Imperative Programming/ (Pemrograman Imperatif)
- Dan sebagainya.

Nah dari segala jenis teknik pemrograman, ada satu teknik pemrograman yang bisa dibilang sangat unik, yaitu /Literate Programming/ (Pemrograman Literasi).

** Terus Pemrograman Literasi itu apaan?

#+BEGIN_QUOTE
Intinya sih, kamu nulis dokumen yang mendeskripsikan program yang buat. Dan sumber kode dari program-mu juga tertulis dokumen itu juga.
#+END_QUOTE

Pemrograman literasi ini beda dengan teknik-teknik pemrograman lainnya, yang mana diwujudkan dalam bentuk kode yang kita tulis. Pemrograman literasi ini lebih ke bagaimana kita *ngoding, dan mendokumentasikannya*, ibarat *nulis buku* lah.

** Gils, ngapain juga aku harus ngoding dengan gaya kek gitu?

Yawes, kalo anda ga tertarik gapapa. Tapi liat aja dirimu 10 tahun kedepan kalo masih jadi Programmer, dan kamu mau melihat masa mudamu yang cemerlang waktu ngoding, dan kamu gatau apa yang kamu tulis.

*** Keuntungan

- Kamu bisa dengan mudah memahami programmu.
- Programmu juga akan mudah dipahami oleh orang lain.
- Dan masih banyak lagi deh.

*** Kekurangan

- Toolbox-nya terbatas, setauku yang bisa kek gini dengan /smooth/ baru Emacs doang.
- Setupnya ribet.
- Kayaknya ga cocok kalo mau ditabrakin dengan /Design Pattern/.

** Belom kebayang nih, kek gimana sih wujudnya?

Wujudnya sih ya kayak tutorial-tutorial di internet, bedanya ini lebih spesifik. Aku mau ngasih contoh implementasi dari tiga fungsi dibawah, yaitu:

- =getRandomInt=
- =getRandomCats=
- =formatCatToString=

*** =getRandomInt=

Fungsi dibawah ini digunakan untuk mendapatkan sebuah angka secara acak. Fungsi ini meminta dua variabel, =min= dan =max=, yang mana dua variabel itulah yang akan menentukan berapa angka minimum dan maksimum yang bisa kita dapatkan ketika kita memanggil fungsi ini. Dimana kedua angka tersebut inklusif di dalam fungsi ini.

#+NAME: getRandomInt
#+BEGIN_SRC js
function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min + 1)) + min;
}
#+END_SRC

*** =getRandomCats=

Fungsi ini digunakan untuk mendapatkan data Kucing secara acak. Data kucing tersebut akan memiliki skema sebagai berikut:

#+NAME: catSchema
#+BEGIN_SRC typescript
type Cat = {
    id: number;
    name: string;
    image: string;
    race: string;
}
#+END_SRC

**** Sumber data kucing

#+NAME: catTables
#+BEGIN_SRC js
const cats = [
    {
        id: 1,
        name: "John",
        image: "https://placekitten.com/200/300",
        race: "British Shorthair"
    },
    {
        id: 2,
        name: "Oyen",
        image: "https://placekitten.com/300/200",
        race: "Domestic Shorthair"
    },
    {
        id: 3,
        name: "Bob",
        image: "https://placekitten.com/300/300",
        race: "Domestic Shorthair"
    },
    {
        id: 4,
        name: "Jenny",
        image: "https://placekitten.com/200/200",
        race: "Domestic Shorthair"
    },
]
#+END_SRC

