id/pemrograman-literasi/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-02 Sat 15:19 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Pemrograman Literasi</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/assets/css/main.css">
                     <link rel="icon" type="image/svg+xml" href="/assets/favicon.svg">
</head>
<body>
<main id="content">
<header>
<h1 class="title">Pemrograman Literasi</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgebf0ba7">Kamu mau ngapain sih, Fik?</a></li>
<li><a href="#org5f4f9f4">Pemrograman Literasi, apaan tuh?</a>
<ul>
<li><a href="#org89cf8e2">Terus Pemrograman Literasi itu apaan?</a></li>
<li><a href="#org1c50711">Gils, ngapain juga aku harus ngoding dengan gaya kek gitu?</a>
<ul>
<li><a href="#org4051e79">Keuntungan</a></li>
<li><a href="#org843b540">Kekurangan</a></li>
</ul>
</li>
<li><a href="#org4808306">Belom kebayang nih, kek gimana sih wujudnya?</a>
<ul>
<li><a href="#orgbf984ef"><code>getRandomInt</code></a></li>
<li><a href="#org13358b4"><code>getRandomCats</code></a>
<ul>
<li><a href="#orgd19ec7c">Sumber data kucing</a></li>
<li><a href="#org6d63c8b">Implementasi fungsi</a></li>
</ul>
</li>
<li><a href="#org375ef7c"><code>formatCatToString</code></a></li>
<li><a href="#orgec48034">Program adopsi kucing</a></li>
</ul>
</li>
<li><a href="#org5c9694f">Sebagai masyarakat industri nih, aku melihat itu ga pragmatis sama sekali 😛</a></li>
</ul>
</li>
<li><a href="#orgb21c397">Todo Application</a>
<ul>
<li><a href="#orgc373827">Initialisasi Proyek Node.js</a></li>
<li><a href="#org9ce126a">Instal express</a></li>
<li><a href="#orgbd834b6">Setup express</a></li>
<li><a href="#org4d59510">Initialisasi Data Todo</a></li>
<li><a href="#org9774dd6">Fungsi untuk menambahkan Todo</a></li>
<li><a href="#orgd691ece">Fungsi untuk melihat daftar Todo</a></li>
<li><a href="#org7677ccd">Fungsi untuk memperbarui Todo</a></li>
<li><a href="#org9b6b993">Fungsi untuk menghapus Todo</a></li>
<li><a href="#orgb5afa0b">Nyalain express server-nya</a></li>
</ul>
</li>
<li><a href="#org21486c5">Kesimpulan</a></li>
</ul>
</div>
</nav>
<p>
Pemrograman terpelajar? Pemrograman sastra? Pemrograman non-primitif?
</p>

<div id="outline-container-orgebf0ba7" class="outline-2">
<h2 id="orgebf0ba7">Kamu mau ngapain sih, Fik?</h2>
<div class="outline-text-2" id="text-orgebf0ba7">
<p>
Gatau, gabut, yaudah aku bikin video aja.
</p>

<p>
Pernah ga sih kalian ngoding sesuatu, terus kalian ninggalin kodingan itu selama 1 abad terus tau-tau balik lagi ke kode itu dan kalian bingung buat memahaminya?
</p>

<p>
Ahah, masalah klasik dari seorang <i>programmer</i>, yaitu tidak pernah mendokumentasikan kode dengan baik.
</p>

<p>
Di presentasi ini kita bakal bahas apa sih pemrograman literasi itu, dan kenapa kok ini keren banget buat kita sebagai programmer untuk mulai mencobanya.
</p>
</div>
</div>

<div id="outline-container-org5f4f9f4" class="outline-2">
<h2 id="org5f4f9f4">Pemrograman Literasi, apaan tuh?</h2>
<div class="outline-text-2" id="text-org5f4f9f4">
<p>
Mungkin kamu sebagai programmer udah bosen lah denger istilah <code>Something Programming</code>, sebagai contoh:
</p>

<ul class="org-ul">
<li><i>Object Oriented Programming</i> (Pemrograman Berbasis Objek)</li>
<li><i>Functional Programming</i> (Pemrograman Fungsional)</li>
<li><i>Declarative Programming</i> (Pemrograman Deklaratif)</li>
<li><i>Imperative Programming</i> (Pemrograman Imperatif)</li>
<li>Dan sebagainya.</li>
</ul>

<p>
Nah dari segala jenis teknik pemrograman, ada satu teknik pemrograman yang bisa dibilang sangat unik, yaitu <i>Literate Programming</i> (Pemrograman Literasi).
</p>
</div>

<div id="outline-container-org89cf8e2" class="outline-3">
<h3 id="org89cf8e2">Terus Pemrograman Literasi itu apaan?</h3>
<div class="outline-text-3" id="text-org89cf8e2">
<blockquote>
<p>
Intinya sih, kamu nulis dokumen yang mendeskripsikan program yang buat. Dan sumber kode dari program-mu juga tertulis dokumen itu juga.
</p>
</blockquote>

<p>
Pemrograman literasi ini beda dengan teknik-teknik pemrograman lainnya, yang mana diwujudkan dalam bentuk kode yang kita tulis. Pemrograman literasi ini lebih ke bagaimana kita <b>ngoding, dan mendokumentasikannya</b>, ibarat <b>nulis buku</b> lah.
</p>
</div>
</div>

<div id="outline-container-org1c50711" class="outline-3">
<h3 id="org1c50711">Gils, ngapain juga aku harus ngoding dengan gaya kek gitu?</h3>
<div class="outline-text-3" id="text-org1c50711">
<p>
Yawes, kalo anda ga tertarik gapapa. Tapi liat aja dirimu 10 tahun kedepan kalo masih jadi Programmer, dan kamu mau melihat masa mudamu yang cemerlang waktu ngoding, dan kamu gatau apa yang kamu tulis.
</p>
</div>

<div id="outline-container-org4051e79" class="outline-4">
<h4 id="org4051e79">Keuntungan</h4>
<div class="outline-text-4" id="text-org4051e79">
<ul class="org-ul">
<li>Kamu bisa dengan mudah memahami programmu.</li>
<li>Programmu juga akan mudah dipahami oleh orang lain.</li>
<li>Dan masih banyak lagi deh.</li>
</ul>
</div>
</div>

<div id="outline-container-org843b540" class="outline-4">
<h4 id="org843b540">Kekurangan</h4>
<div class="outline-text-4" id="text-org843b540">
<ul class="org-ul">
<li>Toolbox-nya terbatas, setauku yang bisa kek gini dengan <i>smooth</i> baru Emacs doang.</li>
<li>Setupnya ribet.</li>
<li>Kayaknya ga cocok kalo mau ditabrakin dengan <i>Design Pattern</i>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4808306" class="outline-3">
<h3 id="org4808306">Belom kebayang nih, kek gimana sih wujudnya?</h3>
<div class="outline-text-3" id="text-org4808306">
<p>
Wujudnya sih ya kayak tutorial-tutorial di internet, bedanya ini lebih spesifik. Aku mau ngasih contoh implementasi dari tiga fungsi dibawah, yaitu:
</p>

<ul class="org-ul">
<li><code>getRandomInt</code></li>
<li><code>getRandomCats</code></li>
<li><code>formatCatToString</code></li>
</ul>
</div>

<div id="outline-container-orgbf984ef" class="outline-4">
<h4 id="orgbf984ef"><code>getRandomInt</code></h4>
<div class="outline-text-4" id="text-orgbf984ef">
<p>
Fungsi dibawah ini digunakan untuk mendapatkan sebuah angka secara acak. Fungsi ini meminta dua variabel, <code>min</code> dan <code>max</code>, yang mana dua variabel itulah yang akan menentukan berapa angka minimum dan maksimum yang bisa kita dapatkan ketika kita memanggil fungsi ini. Dimana kedua angka tersebut inklusif di dalam fungsi ini.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org01ae29d"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getRandomInt</span>(<span style="font-weight: bold; font-style: italic;">min</span>, <span style="font-weight: bold; font-style: italic;">max</span>) {
    min = Math.ceil(min);
    max = Math.floor(max);
    <span style="font-weight: bold;">return</span> Math.floor(Math.random() * (max - min + 1)) + min;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org13358b4" class="outline-4">
<h4 id="org13358b4"><code>getRandomCats</code></h4>
<div class="outline-text-4" id="text-org13358b4">
<p>
Fungsi ini digunakan untuk mendapatkan data Kucing secara acak. Data kucing tersebut akan memiliki skema sebagai berikut:
</p>

<div class="org-src-container">
<pre class="src src-typescript" id="org65b624c">type Cat = {
    id: number;
    name: string;
    image: string;
    race: string;
}
</pre>
</div>
</div>

<div id="outline-container-orgd19ec7c" class="outline-5">
<h5 id="orgd19ec7c">Sumber data kucing</h5>
<div class="outline-text-5" id="text-orgd19ec7c">
<div class="org-src-container">
<pre class="src src-js" id="org2952e64"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">cats</span> = [
    {
        id: 1,
        name: <span style="font-style: italic;">"John"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/200/300"</span>,
        race: <span style="font-style: italic;">"British Shorthair"</span>
    },
    {
        id: 2,
        name: <span style="font-style: italic;">"Oyen"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/300/200"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
    {
        id: 3,
        name: <span style="font-style: italic;">"Bob"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/300/300"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
    {
        id: 4,
        name: <span style="font-style: italic;">"Jenny"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/200/200"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
]
</pre>
</div>
</div>
</div>
