content/id/pemrograman-literasi/index.org
**** Implementasi fungsi

Fungsi ini memiliki dependensi ke fungsi lain, yaitu fungsi =getRandomInt=, karena kita ingin mendapatkan data kucing secara acak, maka kita perlu mengambil indeks secara acak di dalam tabel kucing tadi.

#+NAME: getRandomCats
#+BEGIN_SRC js
function getRandomCats() {
    const catTableLength = cats.length; // Menghitung panjang daftar kucing
    const randomCatIndex = getRandomInt(0, catTableLength - 1); // Menghitung indeks dari daftar kucing secara acak
    return cats[randomCatIndex];
}
#+END_SRC

Contoh pengunaan.

#+NAME: getRandomCatsExample
#+BEGIN_SRC js :noweb yes
<<catTables>>
<<getRandomInt>>
<<getRandomCats>>
return getRandomCats()
#+END_SRC

#+RESULTS: getRandomCatsExample
: {
:   id: 3,
:   name: 'Bob',
:   image: 'https://placekitten.com/300/300',
:   race: 'Domestic Shorthair'
: }

*** =formatCatToString=

Fungsi ini digunakan untuk mengolah data seekor Kucing, dan merubahnya menjadi String dengan format yang sudah ditentukan.

#+NAME: formatCatToString
#+BEGIN_SRC js
function formatCatToString(cat) {
    return `Kamu mengadopsi ${cat.name} dengan ras ${cat.race}, lucu kan!`
}
#+END_SRC

*** Program adopsi kucing

Kita dapat membuat sebuah program dari dua fungsi yang sudah kita buat diatas. Program ini berguna untuk mengambil data kucing secara acak dan menampilkannya dengan format:

#+BEGIN_QUOTE
Kamu mengadopsi <Nama Kucing> dengan ras <Nama Ras>, lucu kan!
#+END_QUOTE

Untuk memenuhi kebutuhan diatas, kita perlu memanggil dua fungsi tadi.

#+NAME: main
#+BEGIN_SRC js :noweb yes :results output
<<catTables>>
<<getRandomInt>>
<<getRandomCats>>
<<formatCatToString>>
const cat = getRandomCats();
console.log(formatCatToString(cat));
#+END_SRC

#+RESULTS: main
: Kamu mengadopsi Oyen dengan ras Domestic Shorthair, lucu kan!

** Sebagai masyarakat industri nih, aku melihat itu ga pragmatis sama sekali 游땥

Wo jelas, contoh tadi tuh cuma nyontohin kalo kamu ga perlu ngebikin file =.js= buat melakukan Pemrograman Literasi dengan Javascript.

Nah, karena di dunia industri tuh kita dituntut buat lebih pragmatis dan ada wujudnya, maka dari itu, kuy lah kita cobain bikin sebuah *REST API* yang fungsinya buat melayani kebutuhan /Todo Application/.

Disini kita bakal pake =express= sebagai /Web Framework/-nya.

* Todo Application

Aku gamau bahas terlalu detail terkait /express/, jadi kita langsung cekidot aja untuk instalasi /express/ dan mulai menulis kode dengan /express/.

** Initialisasi Proyek Node.js

Untuk menginstal /express/, kita perlu inisialisasi proyek =node.js= dulu

#+NAME: initNodeJS
#+BEGIN_SRC shell :results output code :exports both
yarn init -y
#+END_SRC

#+RESULTS: initNodeJS
#+begin_src shell
yarn init v1.22.17
success Saved package.json
Done in 0.01s.
#+end_src

** Instal express

Setelah kita menginisialisasi proyek =node.js=, kini saatnya kita instal si =express=.

#+NAME: installExpress
#+BEGIN_SRC shell :results output code :exports both
yarn add express
#+END_SRC

#+RESULTS: installExpress
#+begin_src shell
yarn add v1.22.17
info No lockfile found.
[1/4] Resolving packages...
[2/4] Fetching packages...
[3/4] Linking dependencies...
[4/4] Building fresh packages...
success Saved lockfile.
success Saved 33 new dependencies.
info Direct dependencies
較덕 express@4.18.1
info All dependencies
較럭 accepts@1.3.8
較럭 array-flatten@1.1.1
較럭 body-parser@1.20.0
較럭 call-bind@1.0.2
較럭 content-disposition@0.5.4
較럭 cookie-signature@1.0.6
較럭 cookie@0.5.0
較럭 ee-first@1.1.1
較럭 express@4.18.1
較럭 finalhandler@1.2.0
較럭 forwarded@0.2.0
較럭 has-symbols@1.0.3
較럭 has@1.0.3
較럭 inherits@2.0.4
較럭 ipaddr.js@1.9.1
較럭 media-typer@0.3.0
較럭 merge-descriptors@1.0.1
較럭 methods@1.1.2
較럭 mime-db@1.52.0
較럭 mime-types@2.1.35
較럭 mime@1.6.0
較럭 ms@2.0.0
較럭 negotiator@0.6.3
較럭 object-inspect@1.12.2
較럭 path-to-regexp@0.1.7
較럭 proxy-addr@2.0.7
較럭 raw-body@2.5.1
較럭 safer-buffer@2.1.2
較럭 serve-static@1.15.0
較럭 side-channel@1.0.4
較럭 toidentifier@1.0.1
較럭 utils-merge@1.0.1
較덕 vary@1.1.2
Done in 2.84s.
#+end_src

