id/pemrograman-literasi/index.html

<div id="outline-container-org6d63c8b" class="outline-5">
<h5 id="org6d63c8b">Implementasi fungsi</h5>
<div class="outline-text-5" id="text-org6d63c8b">
<p>
Fungsi ini memiliki dependensi ke fungsi lain, yaitu fungsi <code>getRandomInt</code>, karena kita ingin mendapatkan data kucing secara acak, maka kita perlu mengambil indeks secara acak di dalam tabel kucing tadi.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org94d5f05"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getRandomCats</span>() {
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">catTableLength</span> = cats.length; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Menghitung panjang daftar kucing</span>
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">randomCatIndex</span> = getRandomInt(0, catTableLength - 1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Menghitung indeks dari daftar kucing secara acak</span>
    <span style="font-weight: bold;">return</span> cats[randomCatIndex];
}
</pre>
</div>

<p>
Contoh pengunaan.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org1445697"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">cats</span> = [
    {
        id: 1,
        name: <span style="font-style: italic;">"John"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/200/300"</span>,
        race: <span style="font-style: italic;">"British Shorthair"</span>
    },
    {
        id: 2,
        name: <span style="font-style: italic;">"Oyen"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/300/200"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
    {
        id: 3,
        name: <span style="font-style: italic;">"Bob"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/300/300"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
    {
        id: 4,
        name: <span style="font-style: italic;">"Jenny"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/200/200"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
]
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getRandomInt</span>(<span style="font-weight: bold; font-style: italic;">min</span>, <span style="font-weight: bold; font-style: italic;">max</span>) {
    min = Math.ceil(min);
    max = Math.floor(max);
    <span style="font-weight: bold;">return</span> Math.floor(Math.random() * (max - min + 1)) + min;
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getRandomCats</span>() {
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">catTableLength</span> = cats.length; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Menghitung panjang daftar kucing</span>
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">randomCatIndex</span> = getRandomInt(0, catTableLength - 1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Menghitung indeks dari daftar kucing secara acak</span>
    <span style="font-weight: bold;">return</span> cats[randomCatIndex];
}
<span style="font-weight: bold;">return</span> getRandomCats()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org375ef7c" class="outline-4">
<h4 id="org375ef7c"><code>formatCatToString</code></h4>
<div class="outline-text-4" id="text-org375ef7c">
<p>
Fungsi ini digunakan untuk mengolah data seekor Kucing, dan merubahnya menjadi String dengan format yang sudah ditentukan.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org811c205"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">formatCatToString</span>(<span style="font-weight: bold; font-style: italic;">cat</span>) {
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">`Kamu mengadopsi ${cat.name} dengan ras ${cat.race}, lucu kan!`</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec48034" class="outline-4">
<h4 id="orgec48034">Program adopsi kucing</h4>
<div class="outline-text-4" id="text-orgec48034">
<p>
Kita dapat membuat sebuah program dari dua fungsi yang sudah kita buat diatas. Program ini berguna untuk mengambil data kucing secara acak dan menampilkannya dengan format:
</p>

<blockquote>
<p>
Kamu mengadopsi &lt;Nama Kucing&gt; dengan ras &lt;Nama Ras&gt;, lucu kan!
</p>
</blockquote>

<p>
Untuk memenuhi kebutuhan diatas, kita perlu memanggil dua fungsi tadi.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgc4b0adc"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">cats</span> = [
    {
        id: 1,
        name: <span style="font-style: italic;">"John"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/200/300"</span>,
        race: <span style="font-style: italic;">"British Shorthair"</span>
    },
    {
        id: 2,
        name: <span style="font-style: italic;">"Oyen"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/300/200"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
    {
        id: 3,
        name: <span style="font-style: italic;">"Bob"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/300/300"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
    {
        id: 4,
        name: <span style="font-style: italic;">"Jenny"</span>,
        image: <span style="font-style: italic;">"https://placekitten.com/200/200"</span>,
        race: <span style="font-style: italic;">"Domestic Shorthair"</span>
    },
]
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getRandomInt</span>(<span style="font-weight: bold; font-style: italic;">min</span>, <span style="font-weight: bold; font-style: italic;">max</span>) {
    min = Math.ceil(min);
    max = Math.floor(max);
    <span style="font-weight: bold;">return</span> Math.floor(Math.random() * (max - min + 1)) + min;
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getRandomCats</span>() {
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">catTableLength</span> = cats.length; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Menghitung panjang daftar kucing</span>
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">randomCatIndex</span> = getRandomInt(0, catTableLength - 1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Menghitung indeks dari daftar kucing secara acak</span>
    <span style="font-weight: bold;">return</span> cats[randomCatIndex];
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">formatCatToString</span>(<span style="font-weight: bold; font-style: italic;">cat</span>) {
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">`Kamu mengadopsi ${cat.name} dengan ras ${cat.race}, lucu kan!`</span>
}
<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">cat</span> = getRandomCats();
console.log(formatCatToString(cat));
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5c9694f" class="outline-3">
<h3 id="org5c9694f">Sebagai masyarakat industri nih, aku melihat itu ga pragmatis sama sekali 😛</h3>
<div class="outline-text-3" id="text-org5c9694f">
<p>
Wo jelas, contoh tadi tuh cuma nyontohin kalo kamu ga perlu ngebikin file <code>.js</code> buat melakukan Pemrograman Literasi dengan Javascript.
</p>

<p>
Nah, karena di dunia industri tuh kita dituntut buat lebih pragmatis dan ada wujudnya, maka dari itu, kuy lah kita cobain bikin sebuah <b>REST API</b> yang fungsinya buat melayani kebutuhan <i>Todo Application</i>.
</p>

<p>
Disini kita bakal pake <code>express</code> sebagai <i>Web Framework</i>-nya.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb21c397" class="outline-2">
<h2 id="orgb21c397">Todo Application</h2>
<div class="outline-text-2" id="text-orgb21c397">
<p>
Aku gamau bahas terlalu detail terkait <i>express</i>, jadi kita langsung cekidot aja untuk instalasi <i>express</i> dan mulai menulis kode dengan <i>express</i>.
</p>
</div>

<div id="outline-container-orgc373827" class="outline-3">
<h3 id="orgc373827">Initialisasi Proyek Node.js</h3>
<div class="outline-text-3" id="text-orgc373827">
<p>
Untuk menginstal <i>express</i>, kita perlu inisialisasi proyek <code>node.js</code> dulu
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgcbc2936">yarn init -y
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">yarn init v1.22.17
success Saved package.json
Done<span style="font-weight: bold;"> in</span> 0.01s.
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ce126a" class="outline-3">
<h3 id="org9ce126a">Instal express</h3>
<div class="outline-text-3" id="text-org9ce126a">
<p>
Setelah kita menginisialisasi proyek <code>node.js</code>, kini saatnya kita instal si <code>express</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org11f0818">yarn add express
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">yarn add v1.22.17
info No lockfile found.
[1/4] Resolving packages...
[2/4] Fetching packages...
[3/4] Linking dependencies...
[4/4] Building fresh packages...
success Saved lockfile.
success Saved 33 new dependencies.
info Direct dependencies
&#9492;&#9472; express@4.18.1
info All dependencies
&#9500;&#9472; accepts@1.3.8
&#9500;&#9472; array-flatten@1.1.1
&#9500;&#9472; body-parser@1.20.0
&#9500;&#9472; call-bind@1.0.2
&#9500;&#9472; content-disposition@0.5.4
&#9500;&#9472; cookie-signature@1.0.6
&#9500;&#9472; cookie@0.5.0
&#9500;&#9472; ee-first@1.1.1
&#9500;&#9472; express@4.18.1
&#9500;&#9472; finalhandler@1.2.0
&#9500;&#9472; forwarded@0.2.0
&#9500;&#9472; has-symbols@1.0.3
&#9500;&#9472; has@1.0.3
&#9500;&#9472; inherits@2.0.4
&#9500;&#9472; ipaddr.js@1.9.1
&#9500;&#9472; media-typer@0.3.0
&#9500;&#9472; merge-descriptors@1.0.1
&#9500;&#9472; methods@1.1.2
&#9500;&#9472; mime-db@1.52.0
&#9500;&#9472; mime-types@2.1.35
&#9500;&#9472; mime@1.6.0
&#9500;&#9472; ms@2.0.0
&#9500;&#9472; negotiator@0.6.3
&#9500;&#9472; object-inspect@1.12.2
&#9500;&#9472; path-to-regexp@0.1.7
&#9500;&#9472; proxy-addr@2.0.7
&#9500;&#9472; raw-body@2.5.1
&#9500;&#9472; safer-buffer@2.1.2
&#9500;&#9472; serve-static@1.15.0
&#9500;&#9472; side-channel@1.0.4
&#9500;&#9472; toidentifier@1.0.1
&#9500;&#9472; utils-merge@1.0.1
&#9492;&#9472; vary@1.1.2
Done<span style="font-weight: bold;"> in</span> 2.84s.
</pre>
</div>
</div>
</div>
