content/id/pemrograman-literasi/index.org
** Setup express

Setelah kalian berhasil menginstal express, kini saatnya kita buat sebuah aplikasi express yang setidaknya bisa dinyalain dan dipanggil melalui protokol HTTP.

#+NAME: setupExpress
#+BEGIN_SRC js :tangle ./index.js
const express = require("express") // impor express
const app = express() // initialisasi express
#+END_SRC

Jangan lupa pasang JSON Parser juga, karena kita pengen bikin REST API yang ngomong pake JSON.

#+NAME: addJSONParser
#+BEGIN_SRC js :tangle ./index.js
app.use(express.json());
#+END_SRC

** Initialisasi Data Todo

Kita ga pake /database management system/ dulu, karena ini bakal membuat sedikit lebih kompleks. Jadi ya, pake array aja, nanti kita modifikasi array tersebut berdasarkan permintaan yang terjadi di dalam server.

#+NAME: todoTables
#+BEGIN_SRC js :tangle ./index.js
let todos = [];
#+END_SRC

Nah, untuk skema data todo sendiri bakal kayak gini.

#+NAME: todoSchema
#+BEGIN_SRC typescript
type Todo = {
    id: number;
    content: string;
    isDone: boolean;
    createdAt: Date;
    updatedAt: Date;
    doneAt: Date;
}
#+END_SRC

** Fungsi untuk menambahkan Todo

Supaya user kita bisa menambahkan data Todo ke server kita, server kita harus mempunyai endpoint untuk melakukan aksi tersebut.

Anggep aja endpoint ini kayak URL yang bisa kamu akses melalui browser, bedanya si URL ini nanti bakal dibuka sama program, bukan manusia kayak kamu.

Nah, fungsi ini bakal terekpos di endpoint =POST /api/v1/todos=, dan fungsi ini meminta /request body/ yang sesuai dengan definisi skema dari =Todo=.

#+NAME: createTodo
#+BEGIN_SRC js :tangle ./index.js
app.post("/api/v1/todos", (req, res) => {
    const { content } = req.body;
    const todoID = todos.length + 1;
    const timestamp = new Date();

    const todo = {
        id: todoID,
        content,
        isDone: false,
        createdAt: timestamp,
        updatedAt: timestamp,
        doneAt: null,
    }

    todos.push(todo)

    res.status(201).json(todo);
})
#+END_SRC

Nah setelah endpoint itu jadi, yawes tinggal di-/hit/ langsung aja pake Postman, atau kalo kalian males pake aplikasi GUI, pake perintah =curl= di bawah ini.

#+NAME: postApiV1Todos
#+BEGIN_SRC shell :results output code
curl -X POST \
     -H 'Content-Type: application/json' \
     --data '{ "content": "Ngoding node.js" }' \
     http://localhost:8000/api/v1/todos | python -m json.tool
#+END_SRC

#+RESULTS: postApiV1Todos
#+begin_src shell
{
    "id": 1,
    "content": "Ngoding node.js",
    "isDone": false,
    "createdAt": "2022-07-02T15:03:46.734Z",
    "updatedAt": "2022-07-02T15:03:46.734Z",
    "doneAt": null
}
#+end_src

** Fungsi untuk melihat daftar Todo

Setelah kamu selesai menambahkan apa yang harus kamu lakukan alias Todo action kalian ke dalam server, kamu juga harusnya bisa liat daftar Todo yang udah kamu masukin buat ngecek mana nih yang belum kelar dan mana yang udah kelar.

Karena daftar todo itu bisa aja panjang banget, maka dari itu, sangat disarankan kalo di fungsi ini diberi parameter untuk melakukan penyaringan data. Jadi kita bisa menyaring data Todo yang udah selesai dan data Todo yang belum selesai.

Nah, fungsi ini akan diekspos melalui endpoint =GET /api/v1/todos=.

#+NAME: listTodos
#+BEGIN_SRC js :tangle ./index.js
app.get("/api/v1/todos", (req, res) => {
  const { filters } = req.query; // Mengambil parameter filter dari user.

  // Jika user mengirimkan parameter filter
  // Maka lakukan filtering.
  if (!!filters) {
    const todoListResults = todos.filter((i) => {
      return i.isDone === filters.isDone;
    })

    res.status(200).json(todoListResults);
    return;
  }

  // Jika user tidak mengirimkan parameter filter
  // Yaudah tampilin semua data todo
  res.status(200).json(todos);
});
#+END_SRC

Kalo kalian ingin mencoba endpoint diatas, kamu bisa coba pake Postman, atau pake perintah =curl= dibawah ini.

#+NAME: getApiV1Todos
#+BEGIN_SRC shell :results output code
curl -X GET \
     http://localhost:8000/api/v1/todos | python -m json.tool
#+END_SRC

#+RESULTS: getApiV1Todos
#+begin_src shell
[
    {
        "id": 1,
        "content": "Ngoding node.js",
        "isDone": false,
        "createdAt": "2022-07-02T15:03:10.130Z",
        "updatedAt": "2022-07-02T15:03:10.130Z",
        "doneAt": null
    }
]
#+end_src

