id/pemrograman-literasi/index.html

<div id="outline-container-orgbd834b6" class="outline-3">
<h3 id="orgbd834b6">Setup express</h3>
<div class="outline-text-3" id="text-orgbd834b6">
<p>
Setelah kalian berhasil menginstal express, kini saatnya kita buat sebuah aplikasi express yang setidaknya bisa dinyalain dan dipanggil melalui protokol HTTP.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgfcb9bc0"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">express</span> = require(<span style="font-style: italic;">"express"</span>) <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">impor express</span>
<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">app</span> = express() <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">initialisasi express</span>
</pre>
</div>

<p>
Jangan lupa pasang JSON Parser juga, karena kita pengen bikin REST API yang ngomong pake JSON.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org2f2ac34">app.use(express.json());
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d59510" class="outline-3">
<h3 id="org4d59510">Initialisasi Data Todo</h3>
<div class="outline-text-3" id="text-org4d59510">
<p>
Kita ga pake <i>database management system</i> dulu, karena ini bakal membuat sedikit lebih kompleks. Jadi ya, pake array aja, nanti kita modifikasi array tersebut berdasarkan permintaan yang terjadi di dalam server.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org53a281a"><span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">todos</span> = [];
</pre>
</div>

<p>
Nah, untuk skema data todo sendiri bakal kayak gini.
</p>

<div class="org-src-container">
<pre class="src src-typescript" id="org54c8ebb">type Todo = {
    id: number;
    content: string;
    isDone: boolean;
    createdAt: Date;
    updatedAt: Date;
    doneAt: Date;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9774dd6" class="outline-3">
<h3 id="org9774dd6">Fungsi untuk menambahkan Todo</h3>
<div class="outline-text-3" id="text-org9774dd6">
<p>
Supaya user kita bisa menambahkan data Todo ke server kita, server kita harus mempunyai endpoint untuk melakukan aksi tersebut.
</p>

<p>
Anggep aja endpoint ini kayak URL yang bisa kamu akses melalui browser, bedanya si URL ini nanti bakal dibuka sama program, bukan manusia kayak kamu.
</p>

<p>
Nah, fungsi ini bakal terekpos di endpoint <code>POST /api/v1/todos</code>, dan fungsi ini meminta <i>request body</i> yang sesuai dengan definisi skema dari <code>Todo</code>.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgc5a0a17">app.post(<span style="font-style: italic;">"/api/v1/todos"</span>, (req, res) =&gt; {
    <span style="font-weight: bold;">const</span> { content } = req.body;
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todoID</span> = todos.length + 1;
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">timestamp</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Date</span>();

    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todo</span> = {
        id: todoID,
        content,
        isDone: <span style="font-weight: bold; text-decoration: underline;">false</span>,
        createdAt: timestamp,
        updatedAt: timestamp,
        doneAt: <span style="font-weight: bold; text-decoration: underline;">null</span>,
    }

    todos.push(todo)

    res.status(201).json(todo);
})
</pre>
</div>

<p>
Nah setelah endpoint itu jadi, yawes tinggal di-<i>hit</i> langsung aja pake Postman, atau kalo kalian males pake aplikasi GUI, pake perintah <code>curl</code> di bawah ini.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org6ca5101">curl -X POST <span style="font-style: italic;">\</span>
     -H <span style="font-style: italic;">'Content-Type: application/json'</span> <span style="font-style: italic;">\</span>
     --data <span style="font-style: italic;">'{ "content": "Ngoding node.js" }'</span> <span style="font-style: italic;">\</span>
     http://localhost:8000/api/v1/todos | python -m json.tool
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd691ece" class="outline-3">
<h3 id="orgd691ece">Fungsi untuk melihat daftar Todo</h3>
<div class="outline-text-3" id="text-orgd691ece">
<p>
Setelah kamu selesai menambahkan apa yang harus kamu lakukan alias Todo action kalian ke dalam server, kamu juga harusnya bisa liat daftar Todo yang udah kamu masukin buat ngecek mana nih yang belum kelar dan mana yang udah kelar.
</p>

<p>
Karena daftar todo itu bisa aja panjang banget, maka dari itu, sangat disarankan kalo di fungsi ini diberi parameter untuk melakukan penyaringan data. Jadi kita bisa menyaring data Todo yang udah selesai dan data Todo yang belum selesai.
</p>

<p>
Nah, fungsi ini akan diekspos melalui endpoint <code>GET /api/v1/todos</code>.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org0d701da">app.get(<span style="font-style: italic;">"/api/v1/todos"</span>, (req, res) =&gt; {
  <span style="font-weight: bold;">const</span> { filters } = req.query; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Mengambil parameter filter dari user.</span>

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Jika user mengirimkan parameter filter</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Maka lakukan filtering.</span>
  <span style="font-weight: bold;">if</span> (!!filters) {
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todoListResults</span> = todos.filter((i) =&gt; {
      <span style="font-weight: bold;">return</span> i.isDone === filters.isDone;
    })

    res.status(200).json(todoListResults);
    <span style="font-weight: bold;">return</span>;
  }

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Jika user tidak mengirimkan parameter filter</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Yaudah tampilin semua data todo</span>
  res.status(200).json(todos);
});
</pre>
</div>

<p>
Kalo kalian ingin mencoba endpoint diatas, kamu bisa coba pake Postman, atau pake perintah <code>curl</code> dibawah ini.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org8864428">curl -X GET <span style="font-style: italic;">\</span>
     http://localhost:8000/api/v1/todos | python -m json.tool
</pre>
</div>
</div>
</div>
