content/id/pemrograman-literasi/index.org
** Fungsi untuk memperbarui Todo

Tentu saja, setelah kita menambahkan data Todo, pastinya kita bakal memperbarui data itu, untuk ngasih tau server kalo data Todo itu udah kelar dikerjain atau belum.

Nah maka dari itu, fungsi untuk memperbarui todo diperlukan. Fungsi ini akan menerima 3 parameter, yaitu =id= dari data Todo, =content= dari data Todo tersebut karena kita ingin timpa kontennya dengan data yang baru, dan =isDone= untuk menentukan bahwa data Todo tersebut selesai dikerjakan.

Fungsi ini akan diekspos melalui endpoint =PUT /api/v1/todos/{id}=

#+NAME: updateTodo
#+BEGIN_SRC js :tangle ./index.js
app.put("/api/v1/todos/:id", (req, res) => {
  const { id } = req.params; // Mengambil parameter id dari data Todo
  const { content, isDone } = req.body; // Mengambil parameter content dan isDone

  // Mencari data todo dengan id yang diberikan oleh user
  const todoIndex = todos.findIndex((i) => i.id === Number(id));

  // Kalo todo dengan id yang diberikan user ga ketemu
  // Yaudah kasih tau kalo ga ketemu
  if (todoIndex < 0) {
    res.status(404).json({
      error: {
        message: "Todo not found!"
      }
    });

    return;
  }

  const todo = todos[todoIndex];
  const updatedTodo = {...todo, content, isDone}

  // Jika sudah selesai, maka simpan timestamp
  // ke dalam atribut doneAt
  if (isDone) updatedTodo.doneAt = new Date();

  // Memperbarui data todo dari daftar Todo;
  todos[todoIndex] = updatedTodo;

  res.status(200).json(updatedTodo);
});
#+END_SRC

Kalo kalian ingin mencoba endpoint diatas, kamu bisa coba pake Postman, atau pake perintah =curl= dibawah ini.

#+NAME: putApiV1TodosById
#+BEGIN_SRC shell :results output code
curl -X PUT \
     -H 'Content-Type: application/json' \
     --data '{ "content": "Ngoding node.js", "isDone": true }' \
     http://localhost:8000/api/v1/todos/1 | python -m json.tool
#+END_SRC

#+RESULTS: putApiV1TodosById
#+begin_src shell
{
    "id": 1,
    "content": "Ngoding node.js",
    "isDone": true,
    "createdAt": "2022-07-02T15:03:10.130Z",
    "updatedAt": "2022-07-02T15:03:10.130Z",
    "doneAt": "2022-07-02T15:03:21.223Z"
}
#+end_src

** Fungsi untuk menghapus Todo

Kita sebagai manusia tuh gampang banget keblinger, gampang banget buat keganggu dengan hal-hal sepele. Nah, karena di aplikasi Todo ini dia nampilin semua data, entah disaring atau enggak, jadi daftar Todo tuh bisa panjang banget.

Kamu mungkin pengen ngehapusin beberapa data yang udah ga diperluin, maka dari itu, kita perlu fungsi buat ngehapus data Todo dari database kita.

Fungsi ini akan diekspos melalui endpoint =DELETE /api/v1/todos/{id}=. Dimana fungsi ini akan meminta 1 parameter saja, yaitu =id= dari data Todo yang pengen kita hapus.

#+NAME: deleteTodo
#+BEGIN_SRC js :tangle ./index.js
app.delete("/api/v1/todos/:id", (req, res) => {
  const { id } = req.params; // Mengambil parameter id dari data Todo
  // Mencari data todo dengan id yang diberikan oleh user
  const todoIndex = todos.findIndex((i) => i.id === Number(id));

  // Kalo todo dengan id yang diberikan user ga ketemu
  // Yaudah kasih tau kalo ga ketemu
  if (todoIndex < 0) {
    res.status(404).json({
      error: {
        message: "Todo not found!"
      }
    });

    return;
  }

  todos = todos.filter((i) => i.id !== Number(id));
  res.status(204).end();
});
#+END_SRC

Kalo kalian ingin mencoba endpoint diatas, kamu bisa coba pake Postman, atau pake perintah =curl= dibawah ini.

#+NAME: deleteApiV1TodosById
#+BEGIN_SRC shell :results none
curl -X DELETE http://localhost:8000/api/v1/todos/1
#+END_SRC

** Nyalain express server-nya

Lalu yang terakhir adalah, kode untuk menyalakan server harus ditaruh dipaling akhir.

#+NAME: finalExpress
#+BEGIN_SRC js :tangle ./index.js
const PORT = process.env.PORT || 8000;
app.listen(PORT, () => {
    console.log("Listening on port", PORT);
});
#+END_SRC

* Kesimpulan

Gimana, apakah Pemrograman Literasi ini sangat cocok untuk coba diekplor? Ya silahkan simpulkan sendiri. Tapi, sejauh ini kita dapat mendokumentasikan segala hal dengan baik kalau kita menggunakan paradigma pemrograman ini.
