id/pemrograman-literasi/index.html

<div id="outline-container-org7677ccd" class="outline-3">
<h3 id="org7677ccd">Fungsi untuk memperbarui Todo</h3>
<div class="outline-text-3" id="text-org7677ccd">
<p>
Tentu saja, setelah kita menambahkan data Todo, pastinya kita bakal memperbarui data itu, untuk ngasih tau server kalo data Todo itu udah kelar dikerjain atau belum.
</p>

<p>
Nah maka dari itu, fungsi untuk memperbarui todo diperlukan. Fungsi ini akan menerima 3 parameter, yaitu <code>id</code> dari data Todo, <code>content</code> dari data Todo tersebut karena kita ingin timpa kontennya dengan data yang baru, dan <code>isDone</code> untuk menentukan bahwa data Todo tersebut selesai dikerjakan.
</p>

<p>
Fungsi ini akan diekspos melalui endpoint <code>PUT /api/v1/todos/{id}</code>
</p>

<div class="org-src-container">
<pre class="src src-js" id="org58fe240">app.put(<span style="font-style: italic;">"/api/v1/todos/:id"</span>, (req, res) =&gt; {
  <span style="font-weight: bold;">const</span> { id } = req.params; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Mengambil parameter id dari data Todo</span>
  <span style="font-weight: bold;">const</span> { content, isDone } = req.body; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Mengambil parameter content dan isDone</span>

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Mencari data todo dengan id yang diberikan oleh user</span>
  <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todoIndex</span> = todos.findIndex((i) =&gt; i.id === Number(id));

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Kalo todo dengan id yang diberikan user ga ketemu</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Yaudah kasih tau kalo ga ketemu</span>
  <span style="font-weight: bold;">if</span> (todoIndex &lt; 0) {
    res.status(404).json({
      error: {
        message: <span style="font-style: italic;">"Todo not found!"</span>
      }
    });

    <span style="font-weight: bold;">return</span>;
  }

  <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todo</span> = todos[todoIndex];
  <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">updatedTodo</span> = {...todo, content, isDone}

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Jika sudah selesai, maka simpan timestamp</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">ke dalam atribut doneAt</span>
  <span style="font-weight: bold;">if</span> (isDone) updatedTodo.doneAt = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Date</span>();

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Memperbarui data todo dari daftar Todo;</span>
  todos[todoIndex] = updatedTodo;

  res.status(200).json(updatedTodo);
});
</pre>
</div>

<p>
Kalo kalian ingin mencoba endpoint diatas, kamu bisa coba pake Postman, atau pake perintah <code>curl</code> dibawah ini.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org8af924e">curl -X PUT <span style="font-style: italic;">\</span>
     -H <span style="font-style: italic;">'Content-Type: application/json'</span> <span style="font-style: italic;">\</span>
     --data <span style="font-style: italic;">'{ "content": "Ngoding node.js", "isDone": true }'</span> <span style="font-style: italic;">\</span>
     http://localhost:8000/api/v1/todos/1 | python -m json.tool
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b6b993" class="outline-3">
<h3 id="org9b6b993">Fungsi untuk menghapus Todo</h3>
<div class="outline-text-3" id="text-org9b6b993">
<p>
Kita sebagai manusia tuh gampang banget keblinger, gampang banget buat keganggu dengan hal-hal sepele. Nah, karena di aplikasi Todo ini dia nampilin semua data, entah disaring atau enggak, jadi daftar Todo tuh bisa panjang banget.
</p>

<p>
Kamu mungkin pengen ngehapusin beberapa data yang udah ga diperluin, maka dari itu, kita perlu fungsi buat ngehapus data Todo dari database kita.
</p>

<p>
Fungsi ini akan diekspos melalui endpoint <code>DELETE /api/v1/todos/{id}</code>. Dimana fungsi ini akan meminta 1 parameter saja, yaitu <code>id</code> dari data Todo yang pengen kita hapus.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org1e3ea05">app.<span style="font-weight: bold;">delete</span>(<span style="font-style: italic;">"/api/v1/todos/:id"</span>, (req, res) =&gt; {
  <span style="font-weight: bold;">const</span> { id } = req.params; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Mengambil parameter id dari data Todo</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Mencari data todo dengan id yang diberikan oleh user</span>
  <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todoIndex</span> = todos.findIndex((i) =&gt; i.id === Number(id));

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Kalo todo dengan id yang diberikan user ga ketemu</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Yaudah kasih tau kalo ga ketemu</span>
  <span style="font-weight: bold;">if</span> (todoIndex &lt; 0) {
    res.status(404).json({
      error: {
        message: <span style="font-style: italic;">"Todo not found!"</span>
      }
    });

    <span style="font-weight: bold;">return</span>;
  }

  todos = todos.filter((i) =&gt; i.id !== Number(id));
  res.status(204).end();
});
</pre>
</div>

<p>
Kalo kalian ingin mencoba endpoint diatas, kamu bisa coba pake Postman, atau pake perintah <code>curl</code> dibawah ini.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgb9a4592">curl -X DELETE http://localhost:8000/api/v1/todos/1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5afa0b" class="outline-3">
<h3 id="orgb5afa0b">Nyalain express server-nya</h3>
<div class="outline-text-3" id="text-orgb5afa0b">
<p>
Lalu yang terakhir adalah, kode untuk menyalakan server harus ditaruh dipaling akhir.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orga469953"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">PORT</span> = process.env.PORT || 8000;
app.listen(PORT, () =&gt; {
    console.log(<span style="font-style: italic;">"Listening on port"</span>, PORT);
});
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org21486c5" class="outline-2">
<h2 id="org21486c5">Kesimpulan</h2>
<div class="outline-text-2" id="text-org21486c5">
<p>
Gimana, apakah Pemrograman Literasi ini sangat cocok untuk coba diekplor? Ya silahkan simpulkan sendiri. Tapi, sejauh ini kita dapat mendokumentasikan segala hal dengan baik kalau kita menggunakan paradigma pemrograman ini.
</p>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p>© 2021 Fikri Rahmat Nurhidayat</p>
</footer>
</body>
</html>
